[Survived] BooleanLiteral
fif-payments-bff-cupones/src/domain/Cupon.ts:10:16
 export class Cupon {
   @ApiModelProperty( {
     description : "Id of version" ,
-    required : true,
+    required : false,
     example: ['123456789']
   } )
