[Killed] ObjectLiteral
src/adapter/controller/CuponController.ts:9:10
 import TYPES from './../../config/types';
 import {ApiOperationGet, ApiPath, SwaggerDefinitionConstant} from "swagger-express-ts";
 
-@ApiPath({
-  path: "/api/v1/cupones",
-  name: "Cupon",
-})
+@ApiPath({})
 @controller('/api/v1/cupones')
 export default class CuponController extends BaseHttpController {

[Killed] BlockStatement
src/adapter/controller/CuponController.ts:16:88
 @controller('/api/v1/cupones')
 export default class CuponController extends BaseHttpController {
 
-  constructor(@inject(TYPES.CuponByRutQuery) private cuponByRutQuery: CuponByRutQuery) {
-    super();
-  }
+  constructor(@inject(TYPES.CuponByRutQuery) private cuponByRutQuery: CuponByRutQuery) {}
 
   @ApiOperationGet({

[Survived] StringLiteral
src/adapter/controller/CuponController.ts:21:18
   }
 
   @ApiOperationGet({
-    description: "Get cupones list desc",
+    description: "",
     summary: "Get cupones list summ",
     responses: {

[Killed] BlockStatement
src/adapter/controller/CuponController.ts:30:32
   @httpGet('')
   public async listAllCupones (
     @request() req: Request,
-    @response() res: Response) {
-    const result = await this.cuponByRutQuery.listCuponByRut();
-    return res.status(200).json(result.map(it => ({id: it.id})));
-  }
+    @response() res: Response) {}
 
 }

[Killed] ArrowFunction
src/adapter/controller/CuponController.ts:32:44
     @request() req: Request,
     @response() res: Response) {
     const result = await this.cuponByRutQuery.listCuponByRut();
-    return res.status(200).json(result.map(it => ({id: it.id})));
+    return res.status(200).json(result.map(() => undefined));
   }
 
