[Killed] ArrayDeclaration
src/adapter/rest/CuponRestAdapter.ts:14:14
     try {
       const {data} = await axios.get('http://httpstat.us/500?sleep=5000');
       console.log('Data', data);
-      return [{id: 2}];
+      return [];
     } catch (error) {
       console.log('Error fetching!', error);
