[Survived] StringLiteral
fif-payments-bff-cupones/src/domain/Cupon.ts:5:10
 
 @ApiModel( {
   description : "Cupon description" ,
-  name : "Cupon"
+  name : ""
 } )
 export class Cupon {

[Survived] StringLiteral
fif-payments-bff-cupones/src/domain/Cupon.ts:9:19
 } )
 export class Cupon {
   @ApiModelProperty( {
-    description : "Id of version" ,
+    description : "" ,
     required : true,
     example: ['123456789']

[Survived] StringLiteral
fif-payments-bff-cupones/src/domain/Cupon.ts:11:15
   @ApiModelProperty( {
     description : "Id of version" ,
     required : true,
-    example: ['123456789']
+    example: [""]
   } )
   public id: number;

[Survived] BlockStatement
fif-payments-bff-cupones/src/domain/Cupon.ts:15:26
   } )
   public id: number;
 
-  constructor(id:number) {
-    this.id = id;
-  }
+  constructor(id:number) {}
 
 
